export const calendarEventsData = [
  {
    date: {
      gtm: "GTM+3",
      firstNumber: "6",
      secondNumber: "",
      month: "Сент",
      id: 1,
    },
    card: {
      type: "Встреча",
      title: "Бизнес-встреча",
      subtitle:
        "Встреча бизнес-парнтеров и единомышленников в сфере нетворкинга",
      isMember: true,
      start: "Начало: 13:30 по мск",
      location: "Биржа деловых контактов",
      telNumber: "",
      site: "",
      user: { name: "Анатолий Чемезов", avatar: "/imgSecond/Avatar.png" },
    },
  },
  {
    date: {
      gtm: "GTM+3",
      firstNumber: "7",
      secondNumber: "8",
      month: "Сент",
      id: 1,
    },
    card: {
      type: "Российское мероприятие",
      title: "Российская энергетическая неделя",
      subtitle:
        "Международный форум «Российская энергетическая неделя» является одной из ключевых международных площадок для обсуждения актуальных тенденций развития современного топливно-энергетического комплекса. Мероприятие традиционно проходит на самом высоком уровне с участием руководителей крупнейших компаний энергетической отрасли. Организаторами Форума являются Фонд Росконгресс, Министерство энергетики Российской Федерации при поддержке Правительства Москвы.",
      isMember: false,
      start: "",
      location: "Москва, Россия",
      telNumber: "+7 (495) 640 5844",
      site: "info@rusenergyweek.com",
      user: { name: "", avatar: "" },
    },
  },
  {
    date: {
      gtm: "GTM+3",
      firstNumber: "12",
      secondNumber: "13",
      month: "Сент",
      id: 1,
    },
    card: {
      type: "Зарубежное мероприятие",
      title: "XI Международный Форум «Антиконтрафакт - 2023»",
      subtitle:
        "Форум является главной дискуссионной площадкой Евразийского Экономического Союза, на которой представители органов власти и бизнеса обсуждают вопросы защиты рынка от контрафакта и фальсификата, правового регулирования в сфере стандартизации и сертификации, а также защиты прав интеллектуальной собственности.",
      isMember: false,
      start: "",
      location: "Санкт-Петербург, Россия",
      telNumber: "+7 (812) 406 7472",
      site: "www.antikontrafact-forum.ru",
      user: { name: "", avatar: "" },
    },
  },
  {
    date: {
      gtm: "GTM+3",
      firstNumber: "24",
      secondNumber: "27",
      month: "Сент",
      id: 1,
    },
    card: {
      type: "Российское мероприятие",
      title: "Форум «Азартные игры: отчисления на спорт»",
      subtitle:
        "Форум является основной площадкой для взаимодействия федеральных органов законодательной и исполнительной власти, организаторов азартных игр, общероссийских спортивных федераций и профессиональных спортивных лиг.",
      isMember: true,
      start: "",
      location: "Москва, Россия",
      telNumber: "+7 (495) 640 4440",
      site: "forumais.ru",
      user: { name: "", avatar: "" },
    },
  },
];
